{
  "items": [{
    "key": "w-1",
    "image": "web_shopping",
    "title": "Shopping Insights Beta",
    "subtitle": "A website to visualize Google's shopping data that reflect trends during selected periods of time on a US map. My major responsibilities included styling and animating the UIs, cross-browsers/devices development, and generating visuals with 3D.js",
    "clients": "Google, Grow",
    "tools": "React JS, 3D.js, SCSS, Node",
    "url": "https://thisisgrow.com/work/shopping-insights"
  },{
    "key": "w-2",
    "image": "web_giferator",
    "title": "Madden Giferator",
    "subtitle": "Giferator was a meme generator to promote the EA's Madden 15 game with real time data from the NFL. I created the moderating website to monitor the submissions as well as a tool to mass produce banner ads to promote the site.",
    "clients": "EA, Google, Grow",
    "tools": "React JS, SCSS, Node",
    "url": "https://thisisgrow.com/work/madden-giferator"
  },{
    "key": "w-3",
    "image": "web_rickmobile",
    "title": "Rick Mobile Tour",
    "subtitle": "This project was created to promote and display the tour information for Rick and Morty's cross-country \"Rick Mobile\" (basically a giant Rick in a form or a truck) promotional tour. The project utilized Google Map API to display the corresponding position of the mobile and a twitter feed that displayed posts relating to the tour.",
    "clients": "Adult Swim, Grow",
    "tools": "Vue JS, SCSS, Webpack",
    "url": "https://thisisgrow.com/work/shopping-insights"
  },{
    "key": "w-4",
    "image": "web_joepera",
    "title": "Joe Pera Christmas Giveaway",
    "subtitle": "A short and sweet project to promote the Joe Pera's Christmas Special episode. We were tasked to create a browser's game (reminiscing of old online flash games) that was designed to be annoyingly fun to click through to get to the giveaway part.",
    "clients": "Adult Swim, Grow",
    "tools": "React JS, SCSS, Node",
    "url": "https://thisisgrow.com/work/project-swag-drop"
  },{
    "key": "w-5",
    "image": "web_vibrant",
    "title": "Vibrant Spaces",
    "subtitle": "Vibrant Spaces was a grant project to help support creations of small business in Downtown Norfolk that became part of Selden Market. I helped create the website that hosted information regarding to this project.",
    "clients": "Grow",
    "tools": "Vue JS, SCSS, Node",
    "url": "http://web.archive.org/web/20161022023548/http://vibrantspaces.com/"
  },{
    "key": "w-6",
    "image": "web_foryouonus",
    "title": "For You. On us.",
    "subtitle": "Grow created a website that allows clients to browse and select gifts (shirts, hoodies, and pillows) with the company's branding. I was the part of the administrator webpage creation team. The site was for internal use, to manage incoming orders and shipment status.",
    "clients": "Grow",
    "tools": "React JS, SCSS, Node",
    "url": "https://gift.thisisgrow.com/"
  }]
}